Revit 2026 API

# SolidGeometry Enumeration

---

An enumerated type listing possible ways of exporting solids in 3D views.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum SolidGeometry
```
```vb
Public Enumeration SolidGeometry
```
```cpp
public enum class SolidGeometry
```
```fsharp
type SolidGeometry
```

| Member name | Value | Description |
| --- | --- | --- |
| ACIS | 1 | All visible Revit Building geometry is exported as ACIS 3D solids (except for any elements that are already a polymesh.) |
| Polymesh | 0 | All visible solids are exported as polymesh. |

#### Reference

Autodesk.Revit.DB Namespace